Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSpu_reg.h
/** \brief 1BC, Bin Rejection Mask */
#define SPU0_BIN_REJ55 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001BCu)
/** Alias (User Manual Name) for SPU0_BIN_REJ55.
* To use register names with standard convension, please use SPU0_BIN_REJ55.
*/
#define SPU0_BIN55_REJ (SPU0_BIN_REJ55)

/** \brief 1C0, Bin Rejection Mask */
#define SPU0_BIN_REJ56 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001C0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ56.
* To use register names with standard convension, please use SPU0_BIN_REJ56.
*/
#define SPU0_BIN56_REJ (SPU0_BIN_REJ56)

/** \brief 1C4, Bin Rejection Mask */
#define SPU0_BIN_REJ57 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001C4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ57.
* To use register names with standard convension, please use SPU0_BIN_REJ57.
*/
#define SPU0_BIN57_REJ (SPU0_BIN_REJ57)

/** \brief 1C8, Bin Rejection Mask */
#define SPU0_BIN_REJ58 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001C8u)
/** Alias (User Manual Name) for SPU0_BIN_REJ58.
* To use register names with standard convension, please use SPU0_BIN_REJ58.
*/
#define SPU0_BIN58_REJ (SPU0_BIN_REJ58)

/** \brief 1CC, Bin Rejection Mask */
#define SPU0_BIN_REJ59 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001CCu)
/** Alias (User Manual Name) for SPU0_BIN_REJ59.
* To use register names with standard convension, please use SPU0_BIN_REJ59.
*/
#define SPU0_BIN59_REJ (SPU0_BIN_REJ59)

/** \brief 1D0, Bin Rejection Mask */
#define SPU0_BIN_REJ60 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001D0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ60.
* To use register names with standard convension, please use SPU0_BIN_REJ60.
*/
#define SPU0_BIN60_REJ (SPU0_BIN_REJ60)

/** \brief 1D4, Bin Rejection Mask */
#define SPU0_BIN_REJ61 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001D4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ61.
* To use register names with standard convension, please use SPU0_BIN_REJ61.
*/
#define SPU0_BIN61_REJ (SPU0_BIN_REJ61)

/** \brief 1D8, Bin Rejection Mask */
#define SPU0_BIN_REJ62 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001D8u)
/** Alias (User Manual Name) for SPU0_BIN_REJ62.
* To use register names with standard convension, please use SPU0_BIN_REJ62.
*/
#define SPU0_BIN62_REJ (SPU0_BIN_REJ62)

/** \brief 1DC, Bin Rejection Mask */
#define SPU0_BIN_REJ63 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001DCu)
/** Alias (User Manual Name) for SPU0_BIN_REJ63.
* To use register names with standard convension, please use SPU0_BIN_REJ63.
*/
#define SPU0_BIN63_REJ (SPU0_BIN_REJ63)

/** \brief 1E0, Magnitude Approximation Constants */
#define SPU0_MAGAPPROX /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MAGAPPROX*)0xFA8001E0u)

/** \brief 1E4, NCI Antennae Scaling Factor */
#define SPU0_NCI_SCALAR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR0*)0xFA8001E4u)
/** Alias (User Manual Name) for SPU0_NCI_SCALAR0.
* To use register names with standard convension, please use SPU0_NCI_SCALAR0.
*/
#define SPU0_NCISCALAR0 (SPU0_NCI_SCALAR0)

/** \brief 1E8, NCI Antennae Scaling Factor */
#define SPU0_NCI_SCALAR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR1*)0xFA8001E8u)
/** Alias (User Manual Name) for SPU0_NCI_SCALAR1.
* To use register names with standard convension, please use SPU0_NCI_SCALAR1.
*/
#define SPU0_NCISCALAR1 (SPU0_NCI_SCALAR1)

/** \brief 1EC, NCI Antennae Scaling Factor */
#define SPU0_NCI_SCALAR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR2*)0xFA8001ECu)
/** Alias (User Manual Name) for SPU0_NCI_SCALAR2.
* To use register names with standard convension, please use SPU0_NCI_SCALAR2.
*/
#define SPU0_NCISCALAR2 (SPU0_NCI_SCALAR2)

/** \brief 1F0, NCI Antennae Scaling Factor */
#define SPU0_NCI_SCALAR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_NCI_SCALAR3*)0xFA8001F0u)
/** Alias (User Manual Name) for SPU0_NCI_SCALAR3.
* To use register names with standard convension, please use SPU0_NCI_SCALAR3.
*/
#define SPU0_NCISCALAR3 (SPU0_NCI_SCALAR3)

/** \brief 1F4, CFAR Configuration */
#define SPU0_CFAR0_CFG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFAR_CFG1*)0xFA8001F4u)
/** Alias (User Manual Name) for SPU0_CFAR0_CFG1.
* To use register names with standard convension, please use SPU0_CFAR0_CFG1.
*/
#define SPU0_CFARCFG (SPU0_CFAR0_CFG1)

/** \brief 1F8, CFAR Configuration 2 */
#define SPU0_CFAR0_CFG2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFAR_CFG2*)0xFA8001F8u)
/** Alias (User Manual Name) for SPU0_CFAR0_CFG2.
* To use register names with standard convension, please use SPU0_CFAR0_CFG2.
*/
#define SPU0_CFARCFG2 (SPU0_CFAR0_CFG2)

/** \brief 1FC, CFAR Configuration 3 */
#define SPU0_CFAR0_CFG3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFAR_CFG3*)0xFA8001FCu)
/** Alias (User Manual Name) for SPU0_CFAR0_CFG3.
* To use register names with standard convension, please use SPU0_CFAR0_CFG3.
*/
#define SPU0_CFARCFG3 (SPU0_CFAR0_CFG3)

/** \brief 200, Scalar Addition Operand */
#define SPU0_SCALARADD /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SCALARADD*)0xFA800200u)

/** \brief 204, Scalar Multiplication Operand */
#define SPU0_SCALARMULT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SCALARMULT*)0xFA800204u)

/** \brief 208, Bin Rejection Unit Control */
#define SPU0_BINREJCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BINREJCTRL*)0xFA800208u)

/** \brief 20C, Local Maximum Control */
#define SPU0_LCLMAX /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_LCLMAX*)0xFA80020Cu)

/** \brief 210, Spare Configuration Register  */
#define SPU0_ACFG2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ACFG2*)0xFA800210u)

/** \brief 218, Register CRC */
#define SPU0_REGCRC /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_REGCRC*)0xFA800218u)

/** \brief 21C, SPU Control */
#define SPU0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CTRL*)0xFA80021Cu)

/** \brief 220, Dataset Metadata */
#define SPU0_MD0_METADATA /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_METADATA*)0xFA800220u)

