Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSpu_reg.h
/** \brief 4B0, Monitor CRC Register */
#define SPU0_CRC_DATA74 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004B0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA74.
* To use register names with standard convension, please use SPU0_CRC_DATA74.
*/
#define SPU0_DATA74_CRC (SPU0_CRC_DATA74)

/** \brief 4B4, Monitor CRC Register */
#define SPU0_CRC_DATA75 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004B4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA75.
* To use register names with standard convension, please use SPU0_CRC_DATA75.
*/
#define SPU0_DATA75_CRC (SPU0_CRC_DATA75)

/** \brief 4B8, Monitor CRC Register */
#define SPU0_CRC_DATA76 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004B8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA76.
* To use register names with standard convension, please use SPU0_CRC_DATA76.
*/
#define SPU0_DATA76_CRC (SPU0_CRC_DATA76)

/** \brief 4BC, Monitor CRC Register */
#define SPU0_CRC_DATA77 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004BCu)
/** Alias (User Manual Name) for SPU0_CRC_DATA77.
* To use register names with standard convension, please use SPU0_CRC_DATA77.
*/
#define SPU0_DATA77_CRC (SPU0_CRC_DATA77)

/** \brief 4C0, Monitor CRC Register */
#define SPU0_CRC_DATA78 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004C0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA78.
* To use register names with standard convension, please use SPU0_CRC_DATA78.
*/
#define SPU0_DATA78_CRC (SPU0_CRC_DATA78)

/** \brief 4C4, Monitor CRC Register */
#define SPU0_CRC_DATA79 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004C4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA79.
* To use register names with standard convension, please use SPU0_CRC_DATA79.
*/
#define SPU0_DATA79_CRC (SPU0_CRC_DATA79)

/** \brief 4C8, Monitor CRC Register */
#define SPU0_CRC_DATA80 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004C8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA80.
* To use register names with standard convension, please use SPU0_CRC_DATA80.
*/
#define SPU0_DATA80_CRC (SPU0_CRC_DATA80)

/** \brief 4CC, Monitor CRC Register */
#define SPU0_CRC_DATA81 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004CCu)
/** Alias (User Manual Name) for SPU0_CRC_DATA81.
* To use register names with standard convension, please use SPU0_CRC_DATA81.
*/
#define SPU0_DATA81_CRC (SPU0_CRC_DATA81)

/** \brief 4D0, Monitor CRC Register */
#define SPU0_CRC_DATA82 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004D0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA82.
* To use register names with standard convension, please use SPU0_CRC_DATA82.
*/
#define SPU0_DATA82_CRC (SPU0_CRC_DATA82)

/** \brief 4D4, Monitor CRC Register */
#define SPU0_CRC_DATA83 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004D4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA83.
* To use register names with standard convension, please use SPU0_CRC_DATA83.
*/
#define SPU0_DATA83_CRC (SPU0_CRC_DATA83)

/** \brief 4D8, Monitor CRC Register */
#define SPU0_CRC_DATA84 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004D8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA84.
* To use register names with standard convension, please use SPU0_CRC_DATA84.
*/
#define SPU0_DATA84_CRC (SPU0_CRC_DATA84)

/** \brief 4DC, Monitor CRC Register */
#define SPU0_CRC_DATA85 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8004DCu)
/** Alias (User Manual Name) for SPU0_CRC_DATA85.
* To use register names with standard convension, please use SPU0_CRC_DATA85.
*/
#define SPU0_DATA85_CRC (SPU0_CRC_DATA85)

/** \brief 500, Monitor CRC Register */
#define SPU0_CRC_CTRL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800500u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL0.
* To use register names with standard convension, please use SPU0_CRC_CTRL0.
*/
#define SPU0_CTRL0_CRC (SPU0_CRC_CTRL0)

/** \brief 504, Monitor CRC Register */
#define SPU0_CRC_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800504u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL1.
* To use register names with standard convension, please use SPU0_CRC_CTRL1.
*/
#define SPU0_CTRL1_CRC (SPU0_CRC_CTRL1)

/** \brief 508, Monitor CRC Register */
#define SPU0_CRC_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800508u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL2.
* To use register names with standard convension, please use SPU0_CRC_CTRL2.
*/
#define SPU0_CTRL2_CRC (SPU0_CRC_CTRL2)

/** \brief 50C, Monitor CRC Register */
#define SPU0_CRC_CTRL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA80050Cu)
/** Alias (User Manual Name) for SPU0_CRC_CTRL3.
* To use register names with standard convension, please use SPU0_CRC_CTRL3.
*/
#define SPU0_CTRL3_CRC (SPU0_CRC_CTRL3)

/** \brief 510, Monitor CRC Register */
#define SPU0_CRC_CTRL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800510u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL4.
* To use register names with standard convension, please use SPU0_CRC_CTRL4.
*/
#define SPU0_CTRL4_CRC (SPU0_CRC_CTRL4)

/** \brief 514, Monitor CRC Register */
#define SPU0_CRC_CTRL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800514u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL5.
* To use register names with standard convension, please use SPU0_CRC_CTRL5.
*/
#define SPU0_CTRL5_CRC (SPU0_CRC_CTRL5)

/** \brief 518, Monitor CRC Register */
#define SPU0_CRC_CTRL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800518u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL6.
* To use register names with standard convension, please use SPU0_CRC_CTRL6.
*/
#define SPU0_CTRL6_CRC (SPU0_CRC_CTRL6)

/** \brief 51C, Monitor CRC Register */
#define SPU0_CRC_CTRL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA80051Cu)
/** Alias (User Manual Name) for SPU0_CRC_CTRL7.
* To use register names with standard convension, please use SPU0_CRC_CTRL7.
*/
#define SPU0_CTRL7_CRC (SPU0_CRC_CTRL7)

/** \brief 520, Monitor CRC Register */
#define SPU0_CRC_CTRL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800520u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL8.
* To use register names with standard convension, please use SPU0_CRC_CTRL8.
*/
#define SPU0_CTRL8_CRC (SPU0_CRC_CTRL8)

/** \brief 524, Monitor CRC Register */
#define SPU0_CRC_CTRL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800524u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL9.
* To use register names with standard convension, please use SPU0_CRC_CTRL9.
*/
#define SPU0_CTRL9_CRC (SPU0_CRC_CTRL9)

/** \brief 528, Monitor CRC Register */
#define SPU0_CRC_CTRL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800528u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL10.
* To use register names with standard convension, please use SPU0_CRC_CTRL10.
*/
#define SPU0_CTRL10_CRC (SPU0_CRC_CTRL10)

/** \brief 52C, Monitor CRC Register */
#define SPU0_CRC_CTRL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA80052Cu)
/** Alias (User Manual Name) for SPU0_CRC_CTRL11.
* To use register names with standard convension, please use SPU0_CRC_CTRL11.
*/
#define SPU0_CTRL11_CRC (SPU0_CRC_CTRL11)

/** \brief 530, Monitor CRC Register */
#define SPU0_CRC_CTRL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800530u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL12.
* To use register names with standard convension, please use SPU0_CRC_CTRL12.
*/
#define SPU0_CTRL12_CRC (SPU0_CRC_CTRL12)

