Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSpu_reg.h
/** \brief 3F4, Monitor CRC Register */
#define SPU1_CRC_DATA27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC003F4u)
/** Alias (User Manual Name) for SPU1_CRC_DATA27.
* To use register names with standard convension, please use SPU1_CRC_DATA27.
*/
#define SPU1_DATA27_CRC (SPU1_CRC_DATA27)

/** \brief 3F8, Monitor CRC Register */
#define SPU1_CRC_DATA28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC003F8u)
/** Alias (User Manual Name) for SPU1_CRC_DATA28.
* To use register names with standard convension, please use SPU1_CRC_DATA28.
*/
#define SPU1_DATA28_CRC (SPU1_CRC_DATA28)

/** \brief 3FC, Monitor CRC Register */
#define SPU1_CRC_DATA29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC003FCu)
/** Alias (User Manual Name) for SPU1_CRC_DATA29.
* To use register names with standard convension, please use SPU1_CRC_DATA29.
*/
#define SPU1_DATA29_CRC (SPU1_CRC_DATA29)

/** \brief 400, Monitor CRC Register */
#define SPU1_CRC_DATA30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00400u)
/** Alias (User Manual Name) for SPU1_CRC_DATA30.
* To use register names with standard convension, please use SPU1_CRC_DATA30.
*/
#define SPU1_DATA30_CRC (SPU1_CRC_DATA30)

/** \brief 404, Monitor CRC Register */
#define SPU1_CRC_DATA31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00404u)
/** Alias (User Manual Name) for SPU1_CRC_DATA31.
* To use register names with standard convension, please use SPU1_CRC_DATA31.
*/
#define SPU1_DATA31_CRC (SPU1_CRC_DATA31)

/** \brief 408, Monitor CRC Register */
#define SPU1_CRC_DATA32 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00408u)
/** Alias (User Manual Name) for SPU1_CRC_DATA32.
* To use register names with standard convension, please use SPU1_CRC_DATA32.
*/
#define SPU1_DATA32_CRC (SPU1_CRC_DATA32)

/** \brief 40C, Monitor CRC Register */
#define SPU1_CRC_DATA33 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0040Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA33.
* To use register names with standard convension, please use SPU1_CRC_DATA33.
*/
#define SPU1_DATA33_CRC (SPU1_CRC_DATA33)

/** \brief 410, Monitor CRC Register */
#define SPU1_CRC_DATA34 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00410u)
/** Alias (User Manual Name) for SPU1_CRC_DATA34.
* To use register names with standard convension, please use SPU1_CRC_DATA34.
*/
#define SPU1_DATA34_CRC (SPU1_CRC_DATA34)

/** \brief 414, Monitor CRC Register */
#define SPU1_CRC_DATA35 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00414u)
/** Alias (User Manual Name) for SPU1_CRC_DATA35.
* To use register names with standard convension, please use SPU1_CRC_DATA35.
*/
#define SPU1_DATA35_CRC (SPU1_CRC_DATA35)

/** \brief 418, Monitor CRC Register */
#define SPU1_CRC_DATA36 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00418u)
/** Alias (User Manual Name) for SPU1_CRC_DATA36.
* To use register names with standard convension, please use SPU1_CRC_DATA36.
*/
#define SPU1_DATA36_CRC (SPU1_CRC_DATA36)

/** \brief 41C, Monitor CRC Register */
#define SPU1_CRC_DATA37 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0041Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA37.
* To use register names with standard convension, please use SPU1_CRC_DATA37.
*/
#define SPU1_DATA37_CRC (SPU1_CRC_DATA37)

/** \brief 420, Monitor CRC Register */
#define SPU1_CRC_DATA38 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00420u)
/** Alias (User Manual Name) for SPU1_CRC_DATA38.
* To use register names with standard convension, please use SPU1_CRC_DATA38.
*/
#define SPU1_DATA38_CRC (SPU1_CRC_DATA38)

/** \brief 424, Monitor CRC Register */
#define SPU1_CRC_DATA39 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00424u)
/** Alias (User Manual Name) for SPU1_CRC_DATA39.
* To use register names with standard convension, please use SPU1_CRC_DATA39.
*/
#define SPU1_DATA39_CRC (SPU1_CRC_DATA39)

/** \brief 428, Monitor CRC Register */
#define SPU1_CRC_DATA40 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00428u)
/** Alias (User Manual Name) for SPU1_CRC_DATA40.
* To use register names with standard convension, please use SPU1_CRC_DATA40.
*/
#define SPU1_DATA40_CRC (SPU1_CRC_DATA40)

/** \brief 42C, Monitor CRC Register */
#define SPU1_CRC_DATA41 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0042Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA41.
* To use register names with standard convension, please use SPU1_CRC_DATA41.
*/
#define SPU1_DATA41_CRC (SPU1_CRC_DATA41)

/** \brief 430, Monitor CRC Register */
#define SPU1_CRC_DATA42 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00430u)
/** Alias (User Manual Name) for SPU1_CRC_DATA42.
* To use register names with standard convension, please use SPU1_CRC_DATA42.
*/
#define SPU1_DATA42_CRC (SPU1_CRC_DATA42)

/** \brief 434, Monitor CRC Register */
#define SPU1_CRC_DATA43 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00434u)
/** Alias (User Manual Name) for SPU1_CRC_DATA43.
* To use register names with standard convension, please use SPU1_CRC_DATA43.
*/
#define SPU1_DATA43_CRC (SPU1_CRC_DATA43)

/** \brief 438, Monitor CRC Register */
#define SPU1_CRC_DATA44 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00438u)
/** Alias (User Manual Name) for SPU1_CRC_DATA44.
* To use register names with standard convension, please use SPU1_CRC_DATA44.
*/
#define SPU1_DATA44_CRC (SPU1_CRC_DATA44)

/** \brief 43C, Monitor CRC Register */
#define SPU1_CRC_DATA45 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0043Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA45.
* To use register names with standard convension, please use SPU1_CRC_DATA45.
*/
#define SPU1_DATA45_CRC (SPU1_CRC_DATA45)

/** \brief 440, Monitor CRC Register */
#define SPU1_CRC_DATA46 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00440u)
/** Alias (User Manual Name) for SPU1_CRC_DATA46.
* To use register names with standard convension, please use SPU1_CRC_DATA46.
*/
#define SPU1_DATA46_CRC (SPU1_CRC_DATA46)

/** \brief 444, Monitor CRC Register */
#define SPU1_CRC_DATA47 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00444u)
/** Alias (User Manual Name) for SPU1_CRC_DATA47.
* To use register names with standard convension, please use SPU1_CRC_DATA47.
*/
#define SPU1_DATA47_CRC (SPU1_CRC_DATA47)

/** \brief 448, Monitor CRC Register */
#define SPU1_CRC_DATA48 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00448u)
/** Alias (User Manual Name) for SPU1_CRC_DATA48.
* To use register names with standard convension, please use SPU1_CRC_DATA48.
*/
#define SPU1_DATA48_CRC (SPU1_CRC_DATA48)

/** \brief 44C, Monitor CRC Register */
#define SPU1_CRC_DATA49 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0044Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA49.
* To use register names with standard convension, please use SPU1_CRC_DATA49.
*/
#define SPU1_DATA49_CRC (SPU1_CRC_DATA49)

