Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSpu_reg.h
/** \brief 450, Monitor CRC Register */
#define SPU1_CRC_DATA50 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00450u)
/** Alias (User Manual Name) for SPU1_CRC_DATA50.
* To use register names with standard convension, please use SPU1_CRC_DATA50.
*/
#define SPU1_DATA50_CRC (SPU1_CRC_DATA50)

/** \brief 454, Monitor CRC Register */
#define SPU1_CRC_DATA51 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00454u)
/** Alias (User Manual Name) for SPU1_CRC_DATA51.
* To use register names with standard convension, please use SPU1_CRC_DATA51.
*/
#define SPU1_DATA51_CRC (SPU1_CRC_DATA51)

/** \brief 458, Monitor CRC Register */
#define SPU1_CRC_DATA52 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00458u)
/** Alias (User Manual Name) for SPU1_CRC_DATA52.
* To use register names with standard convension, please use SPU1_CRC_DATA52.
*/
#define SPU1_DATA52_CRC (SPU1_CRC_DATA52)

/** \brief 45C, Monitor CRC Register */
#define SPU1_CRC_DATA53 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0045Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA53.
* To use register names with standard convension, please use SPU1_CRC_DATA53.
*/
#define SPU1_DATA53_CRC (SPU1_CRC_DATA53)

/** \brief 460, Monitor CRC Register */
#define SPU1_CRC_DATA54 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00460u)
/** Alias (User Manual Name) for SPU1_CRC_DATA54.
* To use register names with standard convension, please use SPU1_CRC_DATA54.
*/
#define SPU1_DATA54_CRC (SPU1_CRC_DATA54)

/** \brief 464, Monitor CRC Register */
#define SPU1_CRC_DATA55 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00464u)
/** Alias (User Manual Name) for SPU1_CRC_DATA55.
* To use register names with standard convension, please use SPU1_CRC_DATA55.
*/
#define SPU1_DATA55_CRC (SPU1_CRC_DATA55)

/** \brief 468, Monitor CRC Register */
#define SPU1_CRC_DATA56 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00468u)
/** Alias (User Manual Name) for SPU1_CRC_DATA56.
* To use register names with standard convension, please use SPU1_CRC_DATA56.
*/
#define SPU1_DATA56_CRC (SPU1_CRC_DATA56)

/** \brief 46C, Monitor CRC Register */
#define SPU1_CRC_DATA57 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0046Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA57.
* To use register names with standard convension, please use SPU1_CRC_DATA57.
*/
#define SPU1_DATA57_CRC (SPU1_CRC_DATA57)

/** \brief 470, Monitor CRC Register */
#define SPU1_CRC_DATA58 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00470u)
/** Alias (User Manual Name) for SPU1_CRC_DATA58.
* To use register names with standard convension, please use SPU1_CRC_DATA58.
*/
#define SPU1_DATA58_CRC (SPU1_CRC_DATA58)

/** \brief 474, Monitor CRC Register */
#define SPU1_CRC_DATA59 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00474u)
/** Alias (User Manual Name) for SPU1_CRC_DATA59.
* To use register names with standard convension, please use SPU1_CRC_DATA59.
*/
#define SPU1_DATA59_CRC (SPU1_CRC_DATA59)

/** \brief 478, Monitor CRC Register */
#define SPU1_CRC_DATA60 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00478u)
/** Alias (User Manual Name) for SPU1_CRC_DATA60.
* To use register names with standard convension, please use SPU1_CRC_DATA60.
*/
#define SPU1_DATA60_CRC (SPU1_CRC_DATA60)

/** \brief 47C, Monitor CRC Register */
#define SPU1_CRC_DATA61 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0047Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA61.
* To use register names with standard convension, please use SPU1_CRC_DATA61.
*/
#define SPU1_DATA61_CRC (SPU1_CRC_DATA61)

/** \brief 480, Monitor CRC Register */
#define SPU1_CRC_DATA62 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00480u)
/** Alias (User Manual Name) for SPU1_CRC_DATA62.
* To use register names with standard convension, please use SPU1_CRC_DATA62.
*/
#define SPU1_DATA62_CRC (SPU1_CRC_DATA62)

/** \brief 484, Monitor CRC Register */
#define SPU1_CRC_DATA63 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00484u)
/** Alias (User Manual Name) for SPU1_CRC_DATA63.
* To use register names with standard convension, please use SPU1_CRC_DATA63.
*/
#define SPU1_DATA63_CRC (SPU1_CRC_DATA63)

/** \brief 488, Monitor CRC Register */
#define SPU1_CRC_DATA64 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00488u)
/** Alias (User Manual Name) for SPU1_CRC_DATA64.
* To use register names with standard convension, please use SPU1_CRC_DATA64.
*/
#define SPU1_DATA64_CRC (SPU1_CRC_DATA64)

/** \brief 48C, Monitor CRC Register */
#define SPU1_CRC_DATA65 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0048Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA65.
* To use register names with standard convension, please use SPU1_CRC_DATA65.
*/
#define SPU1_DATA65_CRC (SPU1_CRC_DATA65)

/** \brief 490, Monitor CRC Register */
#define SPU1_CRC_DATA66 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00490u)
/** Alias (User Manual Name) for SPU1_CRC_DATA66.
* To use register names with standard convension, please use SPU1_CRC_DATA66.
*/
#define SPU1_DATA66_CRC (SPU1_CRC_DATA66)

/** \brief 494, Monitor CRC Register */
#define SPU1_CRC_DATA67 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00494u)
/** Alias (User Manual Name) for SPU1_CRC_DATA67.
* To use register names with standard convension, please use SPU1_CRC_DATA67.
*/
#define SPU1_DATA67_CRC (SPU1_CRC_DATA67)

/** \brief 498, Monitor CRC Register */
#define SPU1_CRC_DATA68 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00498u)
/** Alias (User Manual Name) for SPU1_CRC_DATA68.
* To use register names with standard convension, please use SPU1_CRC_DATA68.
*/
#define SPU1_DATA68_CRC (SPU1_CRC_DATA68)

/** \brief 49C, Monitor CRC Register */
#define SPU1_CRC_DATA69 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0049Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA69.
* To use register names with standard convension, please use SPU1_CRC_DATA69.
*/
#define SPU1_DATA69_CRC (SPU1_CRC_DATA69)

/** \brief 4A0, Monitor CRC Register */
#define SPU1_CRC_DATA70 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC004A0u)
/** Alias (User Manual Name) for SPU1_CRC_DATA70.
* To use register names with standard convension, please use SPU1_CRC_DATA70.
*/
#define SPU1_DATA70_CRC (SPU1_CRC_DATA70)

/** \brief 4A4, Monitor CRC Register */
#define SPU1_CRC_DATA71 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC004A4u)
/** Alias (User Manual Name) for SPU1_CRC_DATA71.
* To use register names with standard convension, please use SPU1_CRC_DATA71.
*/
#define SPU1_DATA71_CRC (SPU1_CRC_DATA71)

/** \brief 4A8, Monitor CRC Register */
#define SPU1_CRC_DATA72 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC004A8u)
/** Alias (User Manual Name) for SPU1_CRC_DATA72.
* To use register names with standard convension, please use SPU1_CRC_DATA72.
*/
#define SPU1_DATA72_CRC (SPU1_CRC_DATA72)

/** \brief 4AC, Monitor CRC Register */
#define SPU1_CRC_DATA73 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC004ACu)
/** Alias (User Manual Name) for SPU1_CRC_DATA73.
* To use register names with standard convension, please use SPU1_CRC_DATA73.
*/
#define SPU1_DATA73_CRC (SPU1_CRC_DATA73)

